app/views/books/show.html.erb

          <td id="favorite_buttons_<%= @book.id %>"><%= render "favorites/favorite-btn", book: @book %></td>
          <td id="comments-count">コメント数: <%= @book.book_comments.count %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]