app/controllers/book_comments_controller.rb

    def create
        @book = Book.find(params[:book_id])
        #@book_comment = current_user.book_comments.new(book_comment_params)に省略できる。 誰が投稿、コメントのデータ
        @comment = BookComment.new(book_comment_params)
        @comment.user_id = current_user.id
        @comment.book_id = @book.id
        @comment_new = BookComment.new
        if @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["book_id", 1], ["comment", "cccc"], ["created_at", "2021-06-03 03:53:32.811055"], ["updated_at", "2021-06-03 03:53:32.811055"]]

    def destroy
        comment = BookComment.find(params[:id])
        @book = Book.find(params[:book_id]) #詳しくidを指定
        @comment_new = BookComment.new
        comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 43]]